of60/tutorials/rheoEFoam/selecMembrane/NernstPlanck/solution1D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         Gauss linear;
}

divSchemes
{
    default                  none;
    div(phi,U)               GaussDefCmpw none;  
    div(phi,ci)              GaussDefCmpw cubista;
    div(eMigFlux,ci)         Gauss linear;
}

laplacianSchemes
{
    default                       Gauss linear corrected;
}

interpolationSchemes
{
    default           linear;
      
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
}

// ************************************************************************* //
